app/views/users/sign_in.html.erb

<br/>
<% @login_stat = User.exists?(name: @name, password: @password) %>
---
SELECT  1 AS one FROM `users` WHERE `users`.`name` = 'sunajiu1' AND `users`.`password` = 'sunajiu1' LIMIT 1