app/controllers/articles_controller.rb

INSERT INTO `articles` (`title`, `text`, `created_at`, `updated_at`) VALUES ('First Article!', 'Article Content', '2015-07-31 03:01:25', '2015-07-31 03:01:25')
---
  def create
    @article = Article.new(article_params)
    @article.user_id = session[:user_id]

    if @article.save

SELECT `articles`.* FROM `articles`
---
  def index
    # if session[:login]
    #  redirect_to "users/sign_in"
    # else
      @articles = Article.all