app/controllers/users_controller.rb

  def new
    @user = User.find_by(name:'sunajiu')
---
SELECT  `users`.* FROM `users` WHERE `users`.`name` = 'sunajiu' LIMIT 1

  def create
    @user = User.new(user_params)
    @user.save
---
INSERT INTO `users` (`name`, `password`, `email`, `created_at`, `updated_at`) VALUES ('sunajiu', 'sunajiu', 'sunajiu@yeah.net', '2015-08-07 13:00:35', '2015-08-07 13:00:35')

  def sign_in
    name = params[:name]
    password = params[:password]
    session.clear
    if User.exists?(name:name, password:password)
---
SELECT  1 AS one FROM `users` WHERE `users`.`name` = 'sunajiu1' AND `users`.`password` = 'sunajiu1' LIMIT 1